# 13.	Напишите программу, в которой пользователь будет задавать две строки, а программа - определять количество вхождений одной строки в другой.
import string

string_1 = input('Введите строку 1: ')
string_2 = input('Введите строку 2: ')
print(string_1.count (string_2))